BazelBuild.vscode-bazel
bungcip.better-toml
DavidAnson.vscode-markdownlint
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
jpogran.puppet-vscode
kisstkondoros.vscode-gutter-preview
mauve.terraform
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-vscode.Go
mtxr.sqltools
mushan.vscode-paste-image
rebornix.ruby
redhat.vscode-yaml
rust-lang.rust
sourcegraph.sourcegraph
timonwong.shellcheck
tomoki1207.pdf
zxh404.vscode-proto3
