4ops.packer
adpyke.vscode-sql-formatter
BazelBuild.vscode-bazel
bungcip.better-toml
coolbear.systemd-unit-file
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
earthly.earthfile-syntax-highlighting
esbenp.prettier-vscode
foxundermoon.shell-format
golang.go
hashicorp.terraform
kisstkondoros.vscode-gutter-preview
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
mtxr.sqltools
mushan.vscode-paste-image
phgn.vscode-starlark
rebornix.ruby
redhat.vscode-yaml
rust-lang.rust
sourcegraph.sourcegraph
timonwong.shellcheck
tomoki1207.pdf
tsandall.opa
wingrunr21.vscode-ruby
withfig.fig
zxh404.vscode-proto3
